In [46]:
import pandas as pd
import requests
def get_job_titles(url, json_acum=[], calls=0):
    print(f'Getting info from {url}')
    response = requests.get(url)
    json = response.json()
    json_acum.append(json[:-1])

    root = 'http://api.dataatwork.org/v1'
    link = json[-1]['links'][2]['href']

    next_link = f'{root}{link}'

    if calls <= 5:
        get_job_titles(next_link, json_acum, calls + 1)

    jobs_df = []
    for result in json_acum:
        jobs_df.extend(result)

    return pd.DataFrame(jobs_df)

In [47]:
url = 'http://api.dataatwork.org/v1/jobs?limit=500'
a = get_job_titles(url)

Getting info from http://api.dataatwork.org/v1/jobs?limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=500&limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=0&limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=500&limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=0&limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=500&limit=500
Getting info from http://api.dataatwork.org/v1/jobs?offset=0&limit=500

In [48]:
a

,uuid,title,normalized_job_title,parent_uuid
0,26bc4486dfd0f60b3bb0d8d64e001800,1st Grade Teacher,1st grade teacher,51cc95467c1844c7dc1d923265c023b2
1,9be6e14491305132c175cb1781a3356c,1st Pressman,1st pressman,96f1cf15fe5880d8660c70f0756944ab
2,d38d16bab3f9f25ae34ae3e2aad254d4,1st Pressman On Web Press,1st pressman on web press,96f1cf15fe5880d8660c70f0756944ab
3,8576a78b5c1cae3a567ca7fd34500357,21 Dealer,21 dealer,4be080220c824dcb435d59ebf1c3ce80
4,a59278d7f653db37e54a270345a91a05,2nd Grade Teacher,2nd grade teacher,51cc95467c1844c7dc1d923265c023b2
...,...,...,...,...
3495,d4195c4a24dd9a957d72e04904fdfa66,Advanced Manufacturing Technician,advanced manufacturing technician,98de71a2b00a1c9d904ea3465884889f
3496,d33e11c696ad4879ade1dfdb1825f1a2,Advanced Military Source Operations Officer (A...,advanced military source operations officer amsoo,06dd2fcfd18994fa1bbb4d0b130983c9
3497,b336cb9e4c4371116af7a810c386cd5b,Advanced Military Source Operations Specialist...,advanced military source operations specialist...,38fa0f1e4f3af4981a3bce137272c212
3498,e2de516c216cb38540cc55ce01391e4f,Advanced Nursing Professor,advanced nursing professor,f11ff6b88b2dfb6a10020ee596cf8844
3499,e28657025fb7b66ff64c951d03702559,"Advanced Practice Nurse, Cardiothoracic Surgery",advanced practice nurse cardiothoracic surgery,ceebffa1a369da0c4ebacf2722f95768

In [21]:
df1 = pd.DataFrame({'Codigo': ['1', '2']})
dic = {'1': 'Medico', '2': 'Ingeniero'}

In [22]:
df1

  Codigo
0      1
1      2

In [23]:
dic

{'1': 'Medico', '2': 'Ingeniero'}

In [24]:
df1['Codigo'].replace(dic, inplace=True)

In [25]:
df1

      Codigo
0     Medico
1  Ingeniero

In [49]:
dic = {'Codigo': ['1', '2'], 'Titulo': ['Medico', 'Ingeniero']}
df1 = pd.DataFrame({'Codigo': ['1', '2', '1'], 'Persona': ['Alex', 'David', 'Pedro']})
df2 = pd.DataFrame(dic, index=[e for e in range(len(dic))])

In [50]:
df1

  Codigo Persona
0      1    Alex
1      2   David
2      1   Pedro

In [51]:
df2

  Codigo     Titulo
0      1     Medico
1      2  Ingeniero

In [52]:
df1.merge(df2, left_on='Codigo', right_on='Codigo')

  Codigo Persona     Titulo
0      1    Alex     Medico
1      1   Pedro     Medico
2      2   David  Ingeniero